In [2]:
import pandas as pd

Let's import the csv file

In [8]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/titanic_dataset.csv')

Here is the dataframe with data present in the dataset

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Pandas automatically adds a default index column (the first one). Since the titanic_dataset.csv already contains PassengerId which serves as a suitable index, we can export the database as follows:

In [14]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/titanic_dataset.csv', 
                 index_col="PassengerId")

In [15]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [16]:
df.index

Index([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,
       ...
       1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
      dtype='int64', name='PassengerId', length=418)

In [17]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
df.shape

(418, 11)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, 892 to 1309
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Name      418 non-null    object
 3   Sex       418 non-null    object
 4   Age       332 non-null    float64
 5   SibSp     418 non-null    int64
 6   Parch     418 non-null    int64
 7   Ticket    418 non-null    object
 8   Fare      417 non-null    float64
 9   Cabin     91 non-null     object
 10  Embarked  418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 39.2+ KB

Running df.info() shows the 'Name', 'Sex', 'Ticket', 'Cabin', and 'Embarked' columns are currently the generic object type. To improve performance, ensure type safety, and achieve consistent missing value handling, we should assign these text columns the dedicated string dtype during the read phase using the dtype parameter:

In [24]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/titanic_dataset.csv', 
                 index_col="PassengerId",
                 dtype={'Name': pd.StringDtype(), 'Sex': pd.StringDtype(), 'Ticket': pd.StringDtype(),
                        'Cabin': pd.StringDtype(), 'Embarked': pd.StringDtype()})

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, 892 to 1309
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Name      418 non-null    string
 3   Sex       418 non-null    string
 4   Age       332 non-null    float64
 5   SibSp     418 non-null    int64
 6   Parch     418 non-null    int64
 7   Ticket    418 non-null    string
 8   Fare      417 non-null    float64
 9   Cabin     91 non-null     string
 10  Embarked  418 non-null    string
dtypes: float64(2), int64(4), string(5)
memory usage: 39.2 KB

Let's now examine some descriptive statistics to gain insight into the passengers' details, such as the age of the oldest passenger or the most expensive ticket price.

In [26]:
df.max()

/var/folders/xv/pwx4n4zd0nn545t0k6s1p__c0000gn/T/ipykernel_9886/1151452817.py:1: FutureWarning: <class 'pandas.core.arrays.string_.StringArray'>._reduce will require a `keepdims` parameter in the future
  df.max()

Survived                                    1
Pclass                                      3
Name        van Billiard, Master. Walter John
Sex                                      male
Age                                      76.0
SibSp                                       8
Parch                                       9
Ticket                            W.E.P. 5734
Fare                                 512.3292
Cabin                                      G6
Embarked                                    S
dtype: object

The Fare is in GBP. The most expensice ticke is £512 that seems low for a suit on the transatlantic, but £500 in the early 1900s was worth almost £80K today.

We will analyze whether this passenger, who paid a premium fare, ultimately survived when we examine the survival data later in our analysis.

In [27]:
df.min()

/var/folders/xv/pwx4n4zd0nn545t0k6s1p__c0000gn/T/ipykernel_9886/3962516015.py:1: FutureWarning: <class 'pandas.core.arrays.string_.StringArray'>._reduce will require a `keepdims` parameter in the future
  df.min()

Survived                                0
Pclass                                  1
Name        Abbott, Master. Eugene Joseph
Sex                                female
Age                                  0.17
SibSp                                   0
Parch                                   0
Ticket                             110469
Fare                                  0.0
Cabin                                 A11
Embarked                                C
dtype: object

Let's check now the total Ticket Fare:

In [28]:
df.sum(numeric_only=True)

Survived      152.0000
Pclass        947.0000
Age         10050.5000
SibSp         187.0000
Parch         164.0000
Fare        14856.5376
dtype: float64

7.52